tap "anomalyco/tap"
tap "ariga/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "mediosz/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "sst/tap"
brew "apache-spark"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "node"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "htop"
brew "hugo"
brew "lazygit"
brew "mise"
brew "neovim"
brew "nmap"
brew "ripgrep"
brew "thefuck"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "adobe-acrobat-reader"
cask "nikitabobko/tap/aerospace"
cask "antigravity"
cask "calibre"
cask "claude"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "font-nunito"
cask "font-ubuntu-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "inkscape"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "slack"
cask "spotify"
cask "stremio"
cask "mediosz/tap/swipeaerospace"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zen"
