tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "mediosz/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "tursodatabase/tap"
brew "ast-grep"
brew "bat"
brew "python@3.12"
brew "docker", link: false
brew "docker-compose"
brew "eza"
brew "fd"
brew "icu4c@76"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "htop"
brew "hugo"
brew "lazygit"
brew "neovim"
brew "nmap"
brew "node"
brew "nox"
brew "openjdk"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "python@3.9"
brew "ripgrep"
brew "rust"
brew "tailwindcss"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
cask "adobe-acrobat-reader"
cask "aerospace"
cask "citrix-workspace"
cask "discord"
cask "docker"
cask "font-nunito"
cask "font-ubuntu-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkscape"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notion"
cask "slack"
cask "spotify"
cask "swipeaerospace"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
vscode "asvetliakov.vscode-neovim"
vscode "charliermarsh.ruff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "james-yu.latex-workshop"
vscode "mathematic.vscode-latex"
vscode "ms-azuretools.vscode-docker"
vscode "ms-pyright.pyright"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-wsl"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "snowflake.snowflake-vsc"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.vscodeintellicode"
