tap "gjbae1212/gossm"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "pulumi/tap"
brew "ack"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "harfbuzz"
brew "apache-spark"
brew "coreutils"
brew "asdf"
brew "bat"
brew "gnutls"
brew "tree-sitter"
brew "cask"
brew "cmake"
brew "cocoapods"
brew "codespell"
brew "cookiecutter"
brew "numpy"
brew "dvc"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grep"
brew "grip"
brew "htop"
brew "huggingface-cli"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libpq"
brew "libxml2"
brew "qemu"
brew "lima"
brew "maven"
brew "neovim"
brew "nmap"
brew "node"
brew "pandoc"
brew "pipx"
brew "poetry"
brew "postgresql@14"
brew "prettier"
brew "pure"
brew "python@3.11"
brew "qt@5"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "sphinx-doc", link: true
brew "terraform"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "watch"
brew "wget"
brew "xclip"
brew "yaml-language-server"
brew "gjbae1212/gossm/gossm"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "pulumi/tap/pulumi"
cask "android-studio"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "firefox"
cask "flutter"
cask "font-hack-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "logitech-g-hub"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "neo4j"
cask "notion"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "snowflake.snowflake-vsc"
