tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "asdf"
brew "ast-grep"
brew "python@3.12"
brew "docker", link: false
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gh"
brew "go"
brew "grip"
brew "hatch"
brew "htop"
brew "hugo"
brew "lazygit"
brew "lychee"
brew "neovim"
brew "node"
brew "nox"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "tailwindcss"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "adobe-acrobat-reader"
cask "citrix-workspace"
cask "discord"
cask "docker"
cask "font-nunito"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notion"
cask "skim"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "james-yu.latex-workshop"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "searking.preview-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "snowflake.snowflake-vsc"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
