git
tmux
neovim
python3-pip
ranger
curl
xcape
rename
fonts-font-awesome
fonts-materialdesignicons-webfont
fonts-inconsolata
breeze-icon-theme
breeze-cursor-theme
arc-theme
i3
py3status
gnome-flashback
rofi
feh
compton
volumeicon-alsa
nodejs
npm
cargo
shellcheck
codespell
flake8
isort
okular
inkscape
texlive-full
tk-dev
gconf2
gnome-screenshot
xclip
xsel
dconf-editor
gnome-tweaks
fzf
